Revit 2024 API
AnalysisResultSchema.SetUnits Method
 Sets names and multipliers of all units for result visualization
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void SetUnits(
	IList<string> names,
	IList<double> multipliers
)
Visual Basic
Public Sub SetUnits ( _
	names As IList(Of String), _
	multipliers As IList(Of Double) _
)
Visual C++
public:
void SetUnits(
	IList<String^>^ names,
	IList<double>^ multipliers
)
Parameters
names
Type: System.Collections.Generic.IList<String>
 Unit names for all units (e.g., "Lb" and "Kg")
multipliers
Type: System.Collections.Generic.IList<Double>
 Numerical coefficients mapped to unit names. They adjust measurement values shown in the legend and display (e.g., 1.0 and 0.451 - if actual measurements are in Lb)
Examples
CopyC#
IList<string> unitNames = new List<string>();
unitNames.Add("Feet");
unitNames.Add("Inches");
IList<double> multipliers = new List<double>();
multipliers.Add(1);
multipliers.Add(12);
AnalysisResultSchema resultSchema = new AnalysisResultSchema("Schema Name", "Description");
resultSchema.SetUnits(unitNames, multipliers);
CopyVB.NET
Dim unitNames As IList(Of String) = New List(Of String)()
unitNames.Add("Feet")
unitNames.Add("Inches")
Dim multipliers As IList(Of Double) = New List(Of Double)()
multipliers.Add(1)
multipliers.Add(12)
Dim resultSchema As New AnalysisResultSchema("Schema Name", "Description")
resultSchema.SetUnits(unitNames, multipliers)
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentsInconsistentException |  names is zero-length or contains duplicate or empty names -or- multipliers contains non-positive numbers, or its length is not equal to the length of names
See Also
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace